{
  "1": "Hi there!<br/> I'm Jano, and I’m thrilled to be your personal English teacher for the next 24 days. Together, we'll explore new vocabulary every day, helping you become more confident with the language. The calendar is divided into six exciting themes, so you'll be learning English in a variety of contexts! I promise we'll have a great time—trust the process, and by Christmas, you'll be an English expert!<br/> Ready to dive in?<br/> Well then, let's get this party started!",
  "5": "Hi there!<br/> How are you today? Do you feel like your English is improving? I’m confident it is! Today, we’ll dive into our second chapter, “On the Road.” Over the next few days, you’ll learn new vocabulary that will be helpful for traveling around the world.<br/> Are you ready?<br/> Let’s get started!",
  "9": "Hi there!<br/> New day, new chapter! Are you ready to explore the English language further? This time, we’ll focus on more specific vocabulary. We’ll learn new words and phrases that may be useful when visiting a hospital.<br/> Let’s see how many of these you’re already familiar with!",
  "13": "Now that you’ve learned useful vocabulary and phrases for the hospital, we’ll move on to another exciting topic: the Hair Salon! Who doesn’t enjoy treating themselves to a beautiful haircut from time to time? In the coming days, you’ll learn how to express yourself at the salon, ensuring you get exactly what you want!",
  "17": "As Christmas approaches, your English skills are improving every day! This new chapter may seem a bit challenging at first, but it will be fun to learn and useful for showing off your English skills. Over the next few days, we will focus on idioms—phrases that have meanings different from the individual words. For example, \"kick the bucket\" means to die, not to literally kick a bucket.<br/> You’ll understand what I mean soon! The idioms we’ll explore are very common and will help you speak English more naturally.<br/>One last thing, in this chapter, you’ll complete two vocabulary sessions paired with their corresponding translation sessions, rather than the usual vocabulary-sentence completion-translation-listening format.<br/>Are you ready to sound like a pro?<br/>",
  "21": "Hello again! Welcome to the final chapter of your personalized advent calendar! How are you feeling today? Are the Christmas preparations already causing you stress? Don't worry—I got you! This last chapter will be quick and easy. We’ll explore useful words and phrases related to holidays throughout the year. What are some specific Italian holidays? Which days hold significance during Easter? And, of course, we’ll cover all the essential vocabulary for Christmas! Are you ready for one last ride?",
  "24": "Congratulations! You did it! You've successfully completed your advent calendar and can now consider yourself a true English pro! I’m confident that you can engage in conversations with ease and feel more confident speaking English. While there’s still much to learn, remember that progress comes step by step! We’re proud of you and all that you’ve accomplished! Merry Christmas!"
}